#ifndef __USART_H
#define __USART_H
/******************************************************************************
 * Ресурсы
 PA2,3	- TX2, RX2
 PA9,10 - TX1, RX1
******************************************************************************/
#define AF1 0b0001
//для PA2,3	- TX2, RX2 USART2
#define AF1_AFRL2 (AF1 << (4 * 2))
#define AF1_AFRL3 (AF1 << (4 * 3))
//для PA9,10	- TX1, RX1 USART1
#define AF1_AFRH9 (AF1 << (4 * 1))
#define AF1_AFRH10 (AF1 << (4 * 2))
/******************************************************************************
* Пользовательские типы данных
******************************************************************************/

/******************************************************************************
* Прототипы функций
******************************************************************************/
void UsartInit(void);
void WriteUSART(unsigned char *pointer, unsigned char counter_bytes, USART_TypeDef* USART);
#endif //__USART_H
