/******************************************************************************
* Глобальные установки проекта
******************************************************************************/
#include "timer.h"
#include "motor.h"
#include "led.h"
#include "btn.h"
// Константы
#define CLOCK_FREQUENCY			8000000
#define psc 1
#define arr 20000
#define NUMBER_INTERRUPTS_PER_SECOND (CLOCK_FREQUENCY / psc / arr)
#define TIMER_MOTOR_WORK (NUMBER_INTERRUPTS_PER_SECOND * 60)	//400*60=24000
#define TIMER_LED_BLINK	 (NUMBER_INTERRUPTS_PER_SECOND * 3)	//400*3=1200
/******************************************************************************
* Пользовательские типы данных
******************************************************************************/
typedef union
{
	struct
	{
		unsigned FlagMotorWork	:1;									// Флаг работы двигателя
	};
	unsigned char FlagREG;												// Регистр флагов
} TypeFlag;
/******************************************************************************
* Прототипы функций
******************************************************************************/
void Delay (unsigned long mksecond);
/******************************************************************************
* Глобальные переменные
******************************************************************************/
TypeFlag flag;																	// Флаги
extern TypeBtnStatus btn;												// Нажатые кнопки
